Revit 2024 API
DesignToFabricationConverter.SetMapForFamilySymbolToFabricationPartType Method
 Set a map for the conversion of in line family symbols to similar fabrication part types.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public DesignToFabricationMappingResult SetMapForFamilySymbolToFabricationPartType(
	IDictionary<ElementId, ElementId> typeMappings
)
Visual Basic
Public Function SetMapForFamilySymbolToFabricationPartType ( _
	typeMappings As IDictionary(Of ElementId, ElementId) _
) As DesignToFabricationMappingResult
Visual C++
public:
DesignToFabricationMappingResult SetMapForFamilySymbolToFabricationPartType(
	IDictionary<ElementId^, ElementId^>^ typeMappings
)
Parameters
typeMappings
Type: System.Collections.Generic.IDictionary<ElementId, ElementId>
 The map containing the family symbol element identifiers to the fabrication part type element identifiers to convert to.
Return Value
 If the mapping is properly structured, DesignToFabricationMappingResult.Success is returned. Otherwise, consult the members of DesignToFabricationMappingResult to understand why this call failed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace